src/app/Controllers/WalletController.php

INSERT INTO `transactions` (`wallet_id`, `type`, `direction`, `amount`) VALUES ('1', 'deposit', 'in', 120)
---
                'updated_at' => date('Y-m-d H:i:s'),
            ]);

        model('TransactionModel')->insert([
            'wallet_id' => $wallet['id'],
            'type'      => 'deposit',
            'direction' => 'in',
            'amount'    => $amount,
        ]);

UPDATE `wallets` SET `balance` = 75852901, `updated_at` = '2025-05-07 20:17:51'
WHERE `id` = '1'
UPDATE `wallets` SET `balance` = 2811, `updated_at` = '2025-05-07 20:17:51'
WHERE `id` = '3'
INSERT INTO `transactions` (`wallet_id`, `type`, `direction`, `amount`) VALUES ('1', 'transfer', 'out', 120)
INSERT INTO `transactions` (`wallet_id`, `type`, `direction`, `amount`, `reversal_txn_id`) VALUES ('3', 'transfer', 'in', 120, 176)
---
            return $this->failResourceExists('Insufficient funds');
        }

        $db->table('wallets')->where('id', $walletFrom['id'])
            ->update([
                'balance' => $walletFrom['balance'] - $amount,
                'updated_at' => date('Y-m-d H:i:s')
            ]);

        $db->table('wallets')->where('id', $walletTo['id'])
            ->update([
                'balance' => $walletTo['balance'] + $amount,
                'updated_at' => date('Y-m-d H:i:s')
            ]);

        $db->table('transactions')->insert([
            'wallet_id' => $walletFrom['id'],
            'type'      => 'transfer',
            'direction' => 'out',
            'amount'    => $amount,
        ]);
        $outId = $db->insertID();

        $db->table('transactions')->insert([
            'wallet_id'      => $walletTo['id'],
            'type'           => 'transfer',
            'direction'      => 'in',
            'amount'         => $amount,
            'reversal_txn_id' => $outId,
        ]);